
from pyrogram.emoji import *   
class Translation (object):   
    DOWNLOAD_SUCCESS = """♻️فایل با موفقیت دانلود شد !

▪️ زمان صرف شده : {} ثانیه."""
    FILE_SIZE_ERROR = "ارور ♨️♨️♨️ : نمی توان اندازه فایل را از URL استخراج کرد!"
    MAX_FILE_SIZE = "حجم فایل بیشتر از 2 گیگابایت است. این محدودیت از سمت تلگرام است!"
    LONG_CUS_FILENAME = """نام فایل شما بیشتر از 60 کاراکتر است.
لطفا اسم فایل را کوتاه کنید."""
    UNSUPPORTED_FORMAT = "ارور ♨️♨️♨️ : فرمت فایل {} ساپورت نمیشود!"
    CHOOSE_CMD = "✅ زیرنویس با موفقیت دانلود شد!.\n🔺زیرنویس سافتساب :  /softmux\n🔺زیرنویس هاردساب :  /hardmux \n🔺برداشتن زیرنویس سافتساب : /softremove"
